/***********************************************************************************
 * @file      i2c.h
 * @author    Sunbinyuan（binyuan.sun@welltest.cn）
 * @version   V1.1.0
 * @date      2026-09-27
 * @brief     I2C1总线对外接口
 *
 * @history   V1.1.0 句柄加g_前缀(WT-WI-PE-200 B1规则4-5-1)     ---2026-09-27
 *            V1.0.0 首版                                       ---2026-09-27
 **********************************************************************************/
#ifndef I2C_H
#define I2C_H

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Variable declarations -----------------------------------------------------*/
extern I2C_HandleTypeDef g_hi2c1;

/* Function Prototypes -------------------------------------------------------*/
void i2c1_init(void);

#endif /* I2C_H */
